<template>
    <div id="coorlayout">
    <!-- A区 -->
    <Head></Head>
    <!-- B区代码 -->
    <div class="auto_fixed" :class="auto_fixed">自动粘滞固定头部，需要一直展示的</div>
    <!-- 补位的div，在B区“跳”出文档流之后出现。 -->
    <div class="auto_fixed_fake" :style="{display: auto_fixed.fixed ? 'block':'none'}"></div>
    <!-- C 区 -->
    <div>
      <div>
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
        如果你无法简洁的表达你的想法，那只说明你还不够了解它。
        -- 阿尔伯特·爱因斯坦
      </div>
    </div>
</div>
</template>

<script>
import Head from './Head'
export default {
  name: 'CoorLayout',
  documents: { Head },
  data () {
    return {
      msg: 'stickyhead',
      auto_fixed: {
        fixed: false
      }
    }
  },
  mounted () {
    window.addEventListener('scroll', this.onScroll)
  },
  methods: {
    onScroll () {
      let scrolled = document.documentElement.scrollTop || document.body.scrollTop
      let headerHeight = null
      if (document.getElementsByClassName('header')[0]) {
        headerHeight = document.getElementsByClassName('header')[0].offsetHeight
      }
      console.log('滚动的距离：' + scrolled, '头部的高度：' + headerHeight)
      this.auto_fixed = {
        auto_fixed: true,
        fixed: scrolled >= headerHeight
      }
    }
  }
}
</script>

<style scoped>
.header{
  width: 100%;
}
.content{
  color: #000;
}
.auto_fixed{
  height: 3em;
  background: orange;
  line-height: 3em;
  text-align: center;
}
.fixed{
  position: fixed;
  top: 0px;
  width: 100%;
}
</style>
